(function(){
  /*ここに演習 2 タスク 1 で変数を記述します。*/
  /*ここに演習 2 タスク 1 でドキュメントロード時のイベントハンドラを記述します。*/
  /*ここに演習 2 タスク 2 で Sprite クラス(関数) のインスタンスを格納するための変数オブジェクトを定義します*/
  /*ここに演習 6 タスク 1 で SNOWS_MOVING_CON オブジェクト変数を定義します。*/
  /*ここに演習 8 で Rule クラスを定義します*/
  /*ここに演習 2 タスク 1 で loadAssets 関数を記述します。*/
  /*ここに演習 4 タスク 1 で setHandlers 関数を記述します。*/
  /*ここに演習 2 タスク 2 で getCenterPosition関数を記述します。*/
  /*ここに演習 3 タスク 1 で renderFrame関数を記述します。*/
  /*ここに演習 4 タスク 1 で getRightLimitPosition関数を記述します。*/
  /*ここに演習 5 で isHit 関数を記述します。*/
  /*ここに演習 5 で hitJob 関数を記述します。*/
  /*ここに演習 6 タスク 2 で getRandomPosition 関数を記述します。*/
  /*ここに演習 6 タスク 3 で loadCheck 関数を記述します。*/
})();
